app/views/articles/show.html.erb

  <ul class="comments-box">
    <% @article.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 10]]