app/controllers/articles_controller.rb

  def show
    # Encontrar un registro por ID
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def create
    #INSERT INTO
    @article = current_user.articles.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Otro mas"], ["body", "Este es el primer articulo con usuario registrado"], ["created_at", "2018-08-16 20:24:03.340545"], ["updated_at", "2018-08-16 20:24:03.340545"], ["user_id", 1]]

  def destroy
    #DELETE FROM articles
    @article = Article.find(params[:id])
    @article.destroy #Destroy elimina el objeto de la BD
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]

  def update
    #@article.update_attributes({title: 'Nuevo titulo'})
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]