app/controllers/articles_controller.rb

UPDATE "articles" SET "visits_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["visits_count", 1], ["updated_at", "2018-08-30 20:24:16.279725"], ["id", 9]]
---
  def show
    @article.update_visits_count

SELECT "categories".* FROM "categories"
---
  def new
    @article = Article.new
    @categories = Category.all