app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
  def index
    @comments = Comment.all

INSERT INTO "comments" ("user_id", "article_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["article_id", 7], ["body", "hola este es otro con ajax"], ["created_at", "2018-08-31 21:18:45.134290"], ["updated_at", "2018-08-31 21:18:45.134290"]]
---
  def create
    @comment = current_user.comments.new(comment_params)
    @comment.article = @article
    #@comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_article
      @article = Article.find(params[:article_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_comment
      @comment = Comment.find(params[:id])