app/models/article.rb

  def update_visits_count
    self.update(visits_count: self.visits_count + 1)
---
UPDATE "articles" SET "visits_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["visits_count", 2], ["updated_at", "2018-09-15 20:35:30.065391"], ["id", 10]]